# Setup
cask_args appdir: '/Applications'
tap 'Homebrew/bundle'
tap 'caskroom/cask'
tap 'railwaycat/emacsmacport'

# Common utities
brew "ack"
brew "autojump"
brew "caskroom/cask/brew-cask"
brew "cask"
brew "ccrypt"
brew "chromedriver"
brew "curl"
brew "editorconfig"
brew "fabric"
brew "railwaycat/emacsmacport/emacs-mac"
brew "fswatch"
brew "git"
brew "gnupg"
brew "graphicsmagick"
brew "hub"
brew "mercurial"
brew "mysql"
brew "node"
brew "postgresql"
brew "redis"
brew "stow"
brew "wget"
brew "zsh-syntax-highlighting"
brew "autoenv"

# Apps
cask "slack"

# Optionals
# cask slate
# cask controlplane
# cask atext
# cask deluge
